tutorials/stagnationFlowReactor.Case1/constant/thermo.FTM
species         5 ( O2 H2O AR H2 N2 );

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.0014879768 -5.68476e-07 1.0097038e-10 -6.753351e-15 -922.7977 5.980528 );
        lowCpCoeffs     ( 3.298677 0.0014082404 -3.963222e-06 5.641515e-09 -2.444854e-12 -1020.8999 3.950372 );
    }
    elements
    {
        N               2;
    }
    transport
    {
        As              1.512e-06;
        Ts              120;

        muCoeffs        (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs     (1.73563 -3.66431 0.664846 -0.0328505);
        DijCoeffs       (
                            (-23.6684 3.3315 -0.221273 0.00973849)
                            (-29.5549 5.5433 -0.487098 0.020417)
                            (-24.4094 3.6032 -0.256022 0.0112241)
                            (-20.1566 2.46383 -0.10894 0.00488439)
                            (-23.4264 3.23738 -0.209349 0.00923455)
        );
    }
}

CO2
{
    specie
    {
        molWeight       44.00995;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.85746029 0.00441437026 -2.21481404e-06 5.23490188e-10 -4.72084164e-14 -48759.166 2.27163806 );
        lowCpCoeffs     ( 2.35677352 0.00898459677 -7.12356269e-06 2.45919022e-09 -1.43699548e-13 -48371.9697 9.90105222 );
    }
    elements
    {
        C               1;
        O               2;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.28253784 0.00148308754 -7.57966669e-07 2.09470555e-10 -2.16717794e-14 -1088.45772 5.45323129 );
        lowCpCoeffs     ( 3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573 );
    }
    elements
    {
        O               2;
    }
    transport
    {
        As              1.512e-06;
        Ts              120;

        muCoeffs        (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs     (-13.8944 3.07851 -0.297333 0.0127535);
        DijCoeffs       (
                            (-23.9457 3.43976 -0.23516 0.0103338)
                            (-29.7467 5.60295 -0.492151 0.0205307)
                            (-24.6833 3.7065 -0.268936 0.0117631)
                            (-20.3209 2.54556 -0.119912 0.00537589)
                            (-23.6684 3.3315 -0.221273 0.00973849)
        );
    }
}

H2
{
    specie
    {
        molWeight       2.01594;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.3372792 -4.94024731e-05 4.99456778e-07 -1.79566394e-10 2.00255376e-14 -950.158922 -3.20502331 );
        lowCpCoeffs     ( 2.34433112 0.00798052075 -1.9478151e-05 2.01572094e-08 -7.37611761e-12 -917.935173 0.683010238 );
    }
    elements
    {
        H               2;
    }
    transport
    {
        As              1.512e-06;
        Ts              120;

        muCoeffs        (-16.1416 1.00298 -0.0500972 0.00232852);
        kappaCoeffs     (-1.53184 -0.781713 0.159653 -0.00463867);
        DijCoeffs       (
                            (-20.3209 2.54556 -0.119912 0.00537589)
                            (-25.5902 4.60674 -0.381662 0.016488)
                            (-20.7859 2.7361 -0.145105 0.0064876)
                            (-18.832 2.19836 -0.0762416 0.00355188)
                            (-20.1566 2.46383 -0.10894 0.00488439)
        );
    }
}

CH4
{
    specie
    {
        molWeight       16.04303;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 0.074851495 0.0133909467 -5.73285809e-06 1.22292535e-09 -1.0181523e-13 -9468.34459 18.437318 );
        lowCpCoeffs     ( 5.14987613 -0.0136709788 4.91800599e-05 -4.84743026e-08 1.66693956e-11 -10246.6476 -4.64130376 );
    }
    elements
    {
        C               1;
        H               4;
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.03399249 0.00217691804 -1.64072518e-07 -9.7041987e-11 1.68200992e-14 -30004.2971 4.9667701 );
        lowCpCoeffs     ( 4.19864056 -0.0020364341 6.52040211e-06 -5.48797062e-09 1.77197817e-12 -30293.7267 -0.849032208 );
    }
    elements
    {
        H               2;
        O               1;
    }
    transport
    {
        As              1.512e-06;
        Ts              120;

        muCoeffs        (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs     (12.2672 -9.14258 1.55383 -0.077075);
        DijCoeffs       (
                            (-29.7467 5.60295 -0.492151 0.0205307)
                            (-20.5424 0.984251 0.234554 -0.0156398)
                            (-29.8141 5.62375 -0.49407 0.0205836)
                            (-25.5902 4.60674 -0.381662 0.016488)
                            (-29.5549 5.5433 -0.487098 0.020417)
        );
    }
}

AR
{
    specie
    {
        molWeight       39.948;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.5 0 0 0 0 -745.375 4.366 );
        lowCpCoeffs     ( 2.5 0 0 0 0 -745.375 4.366 );
    }
    elements
    {
        Ar              1;
    }
    transport
    {
        As              1.512e-06;
        Ts              120;

        muCoeffs        (-21.231 3.42146 -0.368176 0.0162828);
        kappaCoeffs     (-14.5711 3.42146 -0.368176 0.0162828);
        DijCoeffs       (
                            (-24.6833 3.7065 -0.268936 0.0117631)
                            (-29.8141 5.62375 -0.49407 0.0205836)
                            (-25.6437 4.06147 -0.314739 0.013742)
                            (-20.7859 2.7361 -0.145105 0.0064876)
                            (-24.4094 3.6032 -0.256022 0.0112241)
        );
    }
}
